app/controllers/api/books_controller.rb

        def show
            @book = Book.find(params[:id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1

        def update
            @book = Book.find(params[:id])
            if current_user.id == @book.user_id
               if @book.update(book_params)
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
UPDATE `books` SET `transcation` = 0, `price` = 70.0, `updated_at` = '2018-06-08 12:34:35' WHERE `books`.`id` = 3

           def exchange
              @wanted_book =  Book.find(params[:id])
              @books = Book.all
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT `books`.* FROM `books`