app/controllers/api/orders_controller.rb

INSERT INTO `orders` (`user_id`, `book_id`, `state`, `seller`, `transcation`, `created_at`, `updated_at`) VALUES (6, 2, 0, 1, 1, '2018-06-08 17:02:02', '2018-06-08 17:02:02')
---
    def create
      @current_user = AuthorizeApiRequest.call(request.headers).result
      if @current_user
        if @book.is_available.eql? true
          if @book.transcation.eql? "Free Share"
            @order = @book.orders.new(:book_id => @book.id, :user_id => @current_user.id, :state => 0, :seller => @book.user_id, :transcation => @book.transcation, :price => @book.price)
            if @order.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
---
    def set_book
      @book = Book.find(params[:book_id])