app/controllers/api/v1/book/books_controller.rb

SELECT  `books`.* FROM `books` WHERE `books`.`is_available` = 1 ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM (SELECT  1 AS one FROM `books` WHERE `books`.`is_available` = 1 AND (name LIKE '%test book%' OR description LIKE '%test book%') ORDER BY created_at DESC LIMIT 25 OFFSET 0) subquery_for_count
---
        def index
            @books_all = Book.where(:is_available => 1).all
            if (params[:page]).eql? nil
                current_page=1
            else
                current_page=(params[:page])
            end
            if params[:search]
              @searched_books = Book.where(:is_available => 1).search(params[:search]).order("created_at DESC").page params[:page]

SELECT  `books`.* FROM `books` WHERE `books`.`is_available` = 1 ORDER BY created_at Desc LIMIT 20
SELECT COUNT(*) FROM (SELECT  1 AS one FROM `books` WHERE `books`.`is_available` = 1 ORDER BY created_at Desc LIMIT 20) subquery_for_count
---
         def latest_books
            @latest_books = Book.where(:is_available => 1).order('created_at Desc').limit(20);
            if(@latest_books.count != 0)

SELECT COUNT(*) FROM `categories` INNER JOIN `categories_users` ON `categories`.`id` = `categories_users`.`category_id` WHERE `categories_users`.`user_id` = 2
---
        def recommended_books
            if @current_user
                @recommended_books ||= []
                user_interests =  @current_user.categories
                if user_interests.count != 0

SELECT `books`.* FROM `books`
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
        def show
            if Book.exists?(params[:id])
                @book = Book.find(params[:id])

INSERT INTO `books` (`name`, `description`, `transcation`, `category_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Cindrella', 'After her father unexpectedly dies, young Ella (Lily James) finds herself at the mercy of her cruel stepmother (Cate Blanchett) and stepsisters, who reduce her to scullery maid. Despite her circumstances, she refuses to despair.\nYou will know more on reading the story', 1, 17, 3, '2018-06-16 19:53:06', '2018-06-16 19:53:06')
INSERT INTO `book_images` (`image`, `book_id`, `created_at`, `updated_at`) VALUES ('1529178787_image.jpeg', 5, '2018-06-16 19:53:07', '2018-06-16 19:53:07')
SELECT `users`.* FROM `users` INNER JOIN `categories_users` ON `users`.`id` = `categories_users`.`user_id` WHERE `categories_users`.`category_id` = 17
---
        def create
            if @current_user
                @user = @current_user
                @book = Book.new(book_params)
                if not book_params[:transcation]
                    @book.transcation = "Sell"
                end
                @book.user_id = @user.id
                if @book.save
                    params[:book][:book_images_attributes].each do |file|
                        @book.book_images.create!(:image => file)
                    end

                    #### send notificatios to users that interest this new book
                    @book_category = @book.category
                    @users_interest_book = @book_category.users

                    @users_interest_book.each do |user|

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
UPDATE `books` SET `name` = 'The Time Machine', `description` = 'The Time Machine is a science fiction novella by H. G. Wells, published in 1895 and written as a frame narrative. The work is generally credited with the popularization of the concept of time travel by using a vehicle that allows an operator to travel purposely and selectively forwards or backwards in time. The term \"time machine\", coined by Wells, is now almost universally used to refer to such a vehicle.[1]\n\nThe Time Machine has been adapted into three feature films of the same name, as well as two television versions, and a large number of comic book adaptations. It has also indirectly inspired many more works of fiction in many media productions.', `updated_at` = '2018-06-15 21:00:15' WHERE `books`.`id` = 3
DELETE FROM `book_images` WHERE `book_images`.`id` = 1
INSERT INTO `book_images` (`image`, `book_id`, `created_at`, `updated_at`) VALUES ('image.jpeg', 3, '2018-06-15 21:00:16', '2018-06-15 21:00:16')
---
        def update
            @book = Book.find(params[:id])
            if @current_user.id == @book.user_id
               if @book.update(book_params)
                   params[:book][:book_images_attributes].each do |file|
                    #@bookImages = BookImage.all
                    # for bookImg in @bookImages
                    #     if bookImg.book_id == @book.id
                    #         bookImg.destroy
                    #     end
                    # end
                        @book.book_images.destroy
                       @book.book_images.create!(:image => file)

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
SELECT `books`.* FROM `books`
INSERT INTO `orders` (`user_id`, `book_id`, `seller_id`, `state`, `transcation`, `created_at`, `updated_at`) VALUES (2, 3, 3, 0, 2, '2018-06-15 20:26:15', '2018-06-15 20:26:15')
---
        def exchange
            @wanted_book =  Book.find(params[:id])
            if @wanted_book.transcation == "Exchange"
            @books = Book.all
            @exchangeable_books = Array.new

            for book in @books
                if book.user_id == @current_user.id  && book.transcation == "Exchange"
                    @exchangeable_books << book
                end
            end
            @order = Order.new(user_id: @current_user.id, book_id: @wanted_book.id, seller_id: @wanted_book.user_id, state: "under confirmed", transcation: "Exchange")
            @order.save