app/controllers/api/v1/book/books_controller.rb

         def latest_books
            @latest_books = Book.order('created_at Desc').limit(20);
---
SELECT  `books`.* FROM `books` ORDER BY created_at Desc LIMIT 20