app/controllers/api/v1/book/comments_controller.rb

INSERT INTO `comments` (`user_id`, `book_id`, `comment`, `created_at`, `updated_at`) VALUES (1, 1, 'ddddd', '2018-06-18 15:14:50', '2018-06-18 15:14:50')
---
    def create
      # check user if authenticate or not
      if @current_user
        # check comment not empty and it's length larger than two character
        if ((params[:comment]) && (params[:comment].length >= 2))
          @comment = @book.comments.new(:book_id => @book.id, :user_id => @current_user.id, :comment => params[:comment])
          # save comment and check it saved successfuly
          if @comment.save

SELECT `comments`.* FROM `comments` WHERE `comments`.`book_id` = 1 ORDER BY created_at DESC
---
    def index
      @comments=Comment.where(book_id: @book.id)

UPDATE `comments` SET `comment` = 'ghada edit comment', `updated_at` = '2018-06-19 09:27:41' WHERE `comments`.`id` = 2
---
    def update
      # check user if authenticate or not
      if @current_user
        # check if user has permation to update this comment (owner)
        if @current_user.id == @comment.user_id
          # check comment not empty and it's length larger than two character
          if ((params[:comment]) && (params[:comment].length >= 2))
            # update comment and check if it is updated or not
            if @comment.update(comment_params)

DELETE FROM `comments` WHERE `comments`.`id` = 8
---
    def destroy
      # check user if authenticate or not
      if @current_user
        # check if user has permation to delete this comment (owner)
        if @current_user.id == @comment.user_id
          # check if comment deleted or not
          if @comment.destroy

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
    def set_book
      @book = Book.find(params[:book_id])

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = NULL LIMIT 1
---
    def set_comment
      @comment= Comment.find(params[:id])