app/controllers/api/v1/book/orders_controller.rb

    def create
     # @current_user = AuthorizeApiRequest.call(request.headers).result
      if @current_user
        # check if book is available and approved or not
        if ((@book.is_available.eql? true) && (@book.is_approved.eql? true))
          # check book transcation
          if @book.transcation.eql? "Free Share"
            @prev_order = Order.where(:book_id => @book.id, :user_id => @current_user.id, :state => 0, :seller_id => @book.user_id, :transcation => @book.transcation).first
            if @prev_order == nil
              @order = @book.orders.new(:book_id => @book.id, :user_id => @current_user.id, :state => 0, :seller_id => @book.user_id, :transcation => @book.transcation, :price => @book.price)
            else
              @order = @prev_order

            end
          elsif @book.transcation.eql? "Sell"
            @prev_order = Order.where(:book_id => @book.id, :user_id => @current_user.id, :state => 0, :seller_id => @book.user_id, :transcation => @book.transcation).first
            # check if quantity exist, larger than zero and less than book quantity
            if ((params[:quantity]) && (params[:quantity].to_i <= @book.quantity) && (params[:quantity].to_i > 0))
              @book.quantity =  @book.quantity - params[:quantity].to_i
              # check quantity of the book then update is available
              if (@book.quantity == 0)
                @book.is_available = 0
              end
              if @book.save
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`book_id` = 5 AND `orders`.`user_id` = 2 AND `orders`.`state` = 0 AND `orders`.`seller_id` = 3 AND `orders`.`transcation` = 1 ORDER BY `orders`.`id` ASC LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 6 LIMIT 1
INSERT INTO `orders` (`user_id`, `book_id`, `seller_id`, `state`, `transcation`, `price`, `created_at`, `updated_at`, `quantity`) VALUES (6, 3, 2, 0, 0, 20.0, '2018-06-10 22:08:53', '2018-06-10 22:08:53', 2)
UPDATE `orders` SET `updated_at` = '2018-06-16 22:30:43', `notification_sent` = 1 WHERE `orders`.`id` = 2

              body= "There is new order to your #{@book.name} book."
              click_action= "http://localhost:4200/order/#{@order.id}"
              TasksController.send_notification(@seller,@sender_user ,body , click_action)
              @category=Category.find(@book.category_id)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 2 LIMIT 1

      def exchange_request
        @order = Order.find(params[:id])
        if @order
          @exchangeable_books = params[:books]
          puts @exchangeable_books
          @order.exchangeable_books = @exchangeable_books.to_json
          user = User.find(@order.seller_id)
          @order.notification_sent = true
          @order.save
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 2 LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 2 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `orders` SET `exchangeable_books` = '[<ActionController::Parameters {\"id\"=>4} permitted: false>]', `updated_at` = '2018-06-19 05:33:56' WHERE `orders`.`id` = 1

       def confirm_exchange
        @order = Order.find(params[:id])
        if @order.state == "confirmed"
          render json:{status: 'FAIL', message: 'order has already been confirmed'},status: :ok
        else
          @exchangeable_book = Book.find(params[:book])
          @exchangeable_book.is_available = 0
          @exchangeable_book.save
          @order.exchangeable_book_id = @exchangeable_book.id
          @order.state = "confirmed"
          @book = Book.find(@order.book_id)
          @book.is_available = 0
          if @order.save
            user = User.find(@order.user_id)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
SELECT  `books`.* FROM `books` WHERE `books`.`id` = NULL LIMIT 1
UPDATE `books` SET `is_available` = 0, `updated_at` = '2018-06-19 10:09:27' WHERE `books`.`id` = 3
UPDATE `orders` SET `state` = 1, `exchangeable_book_id` = 3, `updated_at` = '2018-06-19 10:09:28' WHERE `orders`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

       def dismiss_exchange
          @order = Order.find(params[:id])
          # @book = Book.find(@order.book_id)
          # @book.save
          if @order.state == "confirmed"
            render json:{status: 'FAIL', message: 'order has already been confirmed'},status: :ok
          elsif @order.destroy!
            user = User.find(@order.user_id)
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1
DELETE FROM `orders` WHERE `orders`.`id` = 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1

  def showOrder
  @order = Order.find(params[:id])
---
SELECT  `orders`.* FROM `orders` WHERE `orders`.`id` = 1 LIMIT 1

    def set_book
      @book = Book.find(params[:book_id])
---
SELECT  `books`.* FROM `books` WHERE `books`.`id` = NULL LIMIT 1