app/controllers/api/v1/book/replays_controller.rb

INSERT INTO `replays` (`replay`, `user_id`, `comment_id`, `created_at`, `updated_at`) VALUES ('uuuuuuuuuuuu', 6, 9, '2018-06-13 18:42:13', '2018-06-13 18:42:13')
---
    def create
      # check user if authenticate or not
      if @current_user
        # check replay not empty and it's length larger than two character
        if ((params[:replay]) && (params[:replay].length >= 2))
            @replay = @comment.replays.new(:comment_id => @comment.id, :user_id => @current_user.id, :replay => params[:replay])
            # save replay and check it saved successfuly
            if @replay.save

UPDATE `replays` SET `replay` = 'kkkkkkk', `updated_at` = '2018-06-13 19:28:35' WHERE `replays`.`id` = 1
---
    def update
      # check user if authenticate or not
      if @current_user
        # check if user has permation to update this replay (owner)
        if @current_user.id == @replay.user_id
          # check replay not empty and it's length larger than two character
          if ((params[:replay]) && (params[:replay].length >= 2))
            # update replay and check if it is updated or not
            if @replay.update(replay_params)

SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 9 LIMIT 1
---
    def set_comment
      @comment = Comment.find(params[:comment_id])

SELECT  `replays`.* FROM `replays` WHERE `replays`.`id` = 1 LIMIT 1
---
     def set_replay
      @replay= Replay.find(params[:id])