app/controllers/api/v1/book/replies_controller.rb

    def create
      # check user if authenticate or not
      if @current_user
        # check reply not empty and it's length larger than two character
        if ((params[:reply]) && (params[:reply].length >= 2))
            @reply = @comment.replies.new(:comment_id => @comment.id, :user_id => @current_user.id, :reply => params[:reply])
            # save reply and check it saved successfuly
            if @reply.save
---
INSERT INTO `replies` (`reply`, `user_id`, `comment_id`, `created_at`, `updated_at`) VALUES ('aaaaaaaaaa', 1, 1, '2018-06-18 15:17:41', '2018-06-18 15:17:41')

    def update
      # check user if authenticate or not
      if @current_user
        # check if user has permation to update this reply (owner)
        if @current_user.id == @reply.user_id
          # check reply not empty and it's length larger than two character
          if ((params[:reply]) && (params[:reply].length >= 2))
            # update reply and check if it is updated or not
            if @reply.update(reply_params)
---
UPDATE `replies` SET `reply` = 'ghadaaaaaaaaaaaaaaaaaa', `updated_at` = '2018-06-13 22:53:29' WHERE `replies`.`id` = 4

    def destroy
      # check user if authenticate or not
      if @current_user
        # check if user has permation to delete this reply (owner)
        if @current_user.id == @reply.user_id
          # check if reply deleted or not
          if @reply.destroy
---
DELETE FROM `replies` WHERE `replies`.`id` = 4

    def set_comment
      @comment = Comment.find(params[:comment_id])
---
SELECT  `comments`.* FROM `comments` WHERE `comments`.`id` = 9 LIMIT 1

     def set_reply
      @reply= Reply.find(params[:id])
---
SELECT  `replies`.* FROM `replies` WHERE `replies`.`id` = 4 LIMIT 1