app/controllers/api/v1/notification/notification_tokens_controller.rb

INSERT INTO `notification_tokens` (`token`, `user_id`, `created_at`, `updated_at`) VALUES ('cLxrhcf_hR0:APA91bFjdzZpbNDwaE3eTZ7oZG-JEu5szIXUOg-91QaNyNGVgS5pf7uv9LGXjH5a2ALtcASKHElGHi_wHH33NMcIo4n4YQRR5TRIF6R7-KENmTS38ThHLj0csHZ00ZsNHB06-iqsROW6', 2, '2018-06-18 17:06:55', '2018-06-18 17:06:55')
---
        def create
                @notification_token = NotificationToken.new(notification_token_params)
                if @notification_token.save