app/controllers/api/v1/notification/notification_messages_controller.rb

SELECT  1 AS one FROM `notification_messages` WHERE `notification_messages`.`receiver_user` = 3 LIMIT 1
---
    def get_user_notifications

            if  NotificationMessage.exists?(:receiver_user => @current_user.id)

SELECT  1 AS one FROM `notification_messages` WHERE `notification_messages`.`receiver_user` = 3 LIMIT 1
SELECT `notification_messages`.* FROM `notification_messages` WHERE `notification_messages`.`receiver_user` = 2 AND `notification_messages`.`is_seen` = 0
UPDATE `notification_messages` SET `is_seen` = 1, `updated_at` = '2018-06-18 17:23:01' WHERE `notification_messages`.`id` = 1
---
    def update_seen_notification
        if  NotificationMessage.exists?(:receiver_user => @current_user.id)
            @notification_messages = NotificationMessage.where(:receiver_user => @current_user.id).where(:is_seen => 0)
            if @notification_messages.count != 0
                @notification_messages.each do |notification_message|
                    notification_message.update(:is_seen => 1)

SELECT  1 AS one FROM `notification_messages` WHERE `notification_messages`.`receiver_user` = 2 LIMIT 1
---
    def get_no_unseen_notification_messages
        if  NotificationMessage.exists?(:receiver_user => @current_user.id)