app/controllers/api/v1/user/authentication_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'ghada.khamis.m@gmail.com' LIMIT 1
---
      def authenticate
        command = AuthenticateUser.call(params[:email], params[:password])

        if command.success?
          @user= User.find_by_email(params[:email])