app/controllers/api/v1/user/password_resets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'monicaarmanios_333@yahoo.com' LIMIT 1
---
    def create
      user = User.find_by_email(params[:email])

SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'xtpJmFU8vOaOxIz8rvyJbw' LIMIT 1
UPDATE `users` SET `password_digest` = '$2a$10$DII49QjnbH14L42sh88lWeUSqYEA6ZW6nvR/2kk0hDcTjMzkfvjki', `updated_at` = '2018-06-18 21:59:15' WHERE `users`.`id` = 1
---
    def update
      @user = User.find_by_password_reset_token!(params[:id])
      if @user.password_reset_sent_at < 2.hours.ago
        render json:  {status: 'FAIL', message: "Password reset has expired"}, status: :ok
      elsif @user.update_attributes(password_params)