app/controllers/api/v1/user/users_controller.rb

      def create
        @user = User.create!(user_params)
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `role`, `confirm_token`, `created_at`, `updated_at`) VALUES ('Monica M ', 'sci.monicamagdy2019@alexu.edu.eg', '$2a$10$yBUU6OlUKpSMMZww0rN20epVQAVoqlBdpnOY/Hu7ZOgHCWIeTJwZO', 0, 'cnCy5AV5Drsx8Gw8UXjKmw', '2018-06-12 14:05:38', '2018-06-12 14:05:38')

      def confirm_email
          user=User.find_by_confirm_token(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`confirm_token` = '-yvxFAEXhErJ-OT_hz_CAw' LIMIT 1

      def update
        @user=User.find(params[:id])
        @user.update(user_complete_params)
        if params[:phone]

          newPhones = params[:phone].values

        #   phonesarray = JSON.parse(newPhone)
          @phones = Phone.where(user_id: @user.id )
          @phones.each do |oldphone|
            if newPhones.include?(oldphone.phone) == false
              oldphone.destroy
            end #end if
          end  #end do
          newPhones.each do |tel|
            flag=0 #means that new phone not included in old ones
            @phones.each do |old|
            if tel == old.phone
              flag=1
            end #end if
          end  #end do
            if flag == 0
              @phone = Phone.new(user_id: @user.id, phone: tel)
              @phone.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
UPDATE `users` SET `name` = 'Monica Armanyos', `profile_picture` = 'index.jpeg', `updated_at` = '2018-06-13 00:57:17' WHERE `users`.`id` = 2
SELECT `phones`.* FROM `phones` WHERE `phones`.`user_id` = 2
DELETE FROM `phones` WHERE `phones`.`id` = 7
INSERT INTO `phones` (`user_id`, `phone`, `created_at`, `updated_at`) VALUES (2, '01207843890', '2018-06-12 10:27:01', '2018-06-12 10:27:01')

          reg=params[:region].values
          newCity = params[:city].values
          code = params[:postal_code].values
          @addresses= Address.where(user_id: @user.id )
---
SELECT `addresses`.* FROM `addresses` WHERE `addresses`.`user_id` = 2

            end #end do
            if flag == 0
              @address = Address.new(user_id: @user.id, building_number: bno, street: st[i], region: reg[i], city: newCity[i], postal_code: code[i])
              @address.save
---
INSERT INTO `addresses` (`user_id`, `building_number`, `street`, `region`, `city`, `postal_code`, `created_at`, `updated_at`) VALUES (2, 61, 'Ismael Sery', 'smouha', 'alex', '78965', '2018-06-12 10:27:02', '2018-06-12 10:27:02')

        i+=1
          end #end do
        end #end if
        @user.categories.each do |userCateg|
---
SELECT `categories`.* FROM `categories` INNER JOIN `categories_users` ON `categories`.`id` = `categories_users`.`category_id` WHERE `categories_users`.`user_id` = 2

      def show
        @user = @current_user
        @books = Book.all
---
SELECT `books`.* FROM `books`

      def get_user_books
        if  User.exists?(:id => params[:id])
            @user_books= Book.where(:user_id => params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`user_id` = 2