app/controllers/api/v1/user/users_controller.rb

                      #             end
                      #           end
                    if(params[:interests])
                      @oldIntrests= CategoriesUsers.where(user_id: @user.id )
---
SELECT `categories_users`.* FROM `categories_users` WHERE `categories_users`.`user_id` = 3

                      end
                      params[:interests].each do |interest|
                        @newinterest = CategoriesUsers.new(user_id: @user.id, category_id: interest)
                        @newinterest.save
---
INSERT INTO `categories_users` (`user_id`, `category_id`) VALUES (2, 3)

      def show
        if params[:id] == @current_user.id || !params[:id]
          @user = @current_user
        else
          @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1

      def get_user_books
        if  User.exists?(:id => params[:id])
            @user_books= Book.where(:is_approved => 1).where(:is_available => 1).where(:user_id => params[:id])
---
SELECT `books`.* FROM `books` WHERE `books`.`is_approved` = 1 AND `books`.`is_available` = 1 AND `books`.`user_id` = 3