app/controllers/api/v1/user/user_rates_controller.rb

        def create
            @rated_user = User.find(params[:user_id])
            if @rated_user.id == current_user.id
                render json: {status: 'FAIL', message: 'You are not allowed to rate your self!'},status: :ok
            else

               @user_rate = UserRate.where(user_id: @rated_user.id, rated_by: @current_user.id)
               if @user_rate.any?
                 if @user_rate.update(rate: params[:rate])
                    @rated_user.rate = @rated_user.user_rates.average(:rate)
                    if @rated_user.save
                        render json: {status: 'SUCCESS', message: @rated_user.name+' has been rated'},status: :ok
                    else
                        render json: {status: 'FAIL', message: 'Couldn\'t rate '+@rated_user.name},status: :ok
                    end
                 end
               else
                    @user_rate = @rated_user.user_rates.new( user_id: @rated_user.id, rated_by: @current_user.id, rate: params[:rate])
                    if @user_rate.save
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT AVG(`user_rates`.`rate`) FROM `user_rates` WHERE `user_rates`.`user_id` = 2
SELECT `user_rates`.* FROM `user_rates` WHERE `user_rates`.`user_id` = 1 AND `user_rates`.`user_id` = 1 AND `user_rates`.`rated_by` = 3
SELECT  1 AS one FROM `user_rates` WHERE `user_rates`.`user_id` = 2 AND `user_rates`.`rated_by` = 3 LIMIT 1
UPDATE `user_rates` SET `rate` = 3, `updated_at` = '2018-06-12 01:15:24' WHERE `user_rates`.`id` = 1
UPDATE `users` SET `rate` = 4, `updated_at` = '2018-06-11 23:31:22' WHERE `users`.`id` = 2
INSERT INTO `user_rates` (`user_id`, `rated_user_id`, `rate`, `created_at`, `updated_at`) VALUES (2, 2, 4, '2018-06-11 23:31:22', '2018-06-11 23:31:22')