app/controllers/authentication_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'sci.monicamagdy2016@alexu.edu.eg' LIMIT 1
---
    def authenticate
      command = AuthenticateUser.call(params[:email], params[:password])

      if command.success?
        @user= User.find_by_email(params[:email])