app/controllers/users_controller.rb

SELECT `books`.* FROM `books`
---
    def show
      @user = current_user
      @books = Book.all